import { Pipe, PipeTransform } from '@angular/core';

@Pipe({
  name: 'customNumber'
})
export class CustomNumberPipe implements PipeTransform {
  // Метод `transform` виконує перетворення числового значення у рядок зі спеціальним суфіксом
  // Параметр `value` - число, яке ми хочемо перетворити
  transform(value: number): string {
    // Перевірка, чи число більше або рівне 1 мільярду
    if (value >= 1000000000) {
      // Повертає число, поділене на 1 мільярд і округлене до 2 десяткових знаків з суфіксом 'В'
      return (value / 1000000000).toFixed(2) + 'В';
    }
    // Перевірка, чи число більше або рівне 1 мільйону
    else if (value >= 1000000) {
      // Повертає число, поділене на 1 мільйон і округлене до 2 десяткових знаків з суфіксом 'М'
      return (value / 1000000).toFixed(2) + 'М';
    }
    // Перевірка, чи число більше або рівне 1000
    else if (value >= 1000) {
      // Повертає число, поділене на 1000 і округлене до 2 десяткових знаків з суфіксом 'К'
      return (value / 1000).toFixed(2) + 'К';
    }
    // Якщо число менше 1000, повертає його як рядок
    else {
      return value.toString();
    }
  }
}
